In [1]:
from utils import hql_to_df
import settings
settings.set_env('sanguo_ks')

In [2]:
act_sql = '''
select ds, user_id
from raw_activeuser
where ds >= '20160501' and ds <= '20160510'
'''
act_df = hql_to_df(act_sql)
print act_df.head()

         ds     user_id
0  20160510   m49385201
1  20160510  m108654572
2  20160510   m19373220
3  20160510   m45951639
4  20160510  m122603561

## pandas 使用技巧
### pivot_table
`pivot_table`可以将列转成行

In [3]:
act_df['act'] = 1
act_df.pivot_table('act', ['user_id'], 'ds').head()

ds,20160501,20160502,20160503,20160504,20160505,20160506,20160507,20160508,20160509,20160510
user_id,,,,,,,,,,
m100000323,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
m10000442,NaN,NaN,NaN,NaN,NaN,NaN,1.0,1.0,1.0,1.0
m100007951,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
m100011278,1.0,NaN,NaN,1.0,NaN,1.0,NaN,NaN,NaN,NaN
m100011534,NaN,NaN,1.0,NaN,1.0,1.0,1.0,NaN,NaN,NaN

## 其它工具
### pandasql
使用 pandasql 可以直接对 pandas dataframe 执行 SQL 语句

In [4]:
from pandasql import sqldf
sql = '''
select ds, count(*) as dau 
from act_df
group by ds
'''
sqldf(sql, globals())

         ds    dau
0  20160501  33189
1  20160502  32744
2  20160503  27276
3  20160504  28517
4  20160505  30333
5  20160506  31833
6  20160507  35862
7  20160508  35294
8  20160509  28919
9  20160510  27088